package timetable;

import java.util.Calendar;
import main.Menu;

public class TimeTable {
	private int ID;

	public TimeTable(Menu that) { this.ID = that.getID(); }
	
	// 시간표/학식 출력 메서드
	public void timetable() {
		// 시간표 출력
		System.out.println();
		System.out.println("🏫 " + this.ID + "님의 시간표 🏫");
		System.out.println("월               화               수           목                금");
		
		if (this.ID >= 3701 && this.ID <= 3714) {
			System.out.println("생명과학2   공학일반      심화국어   통합수학1    논리학");
			System.out.println("영독작          통합수학1  공학일반    생명과학2    진로활동");
			System.out.println("공학일반       영독작         체육         영독작           심화국어");
			System.out.println("심화국어       심화국어      논리학       공학일반        통합수학1");
			System.out.println("음악            영독작         창체          자율             통합수학1");
			System.out.println("통합수학1  통합수학2   창체          논리학          생명과학2");
			System.out.println("논리학         생명과학2  통합수학2  통합수학2   한국사");
		}
		else {
			System.out.println("통합수학2   심화국어      공학일반   통합수학1    교육학");
			System.out.println("영독작          생명과학2  심화국어    통합수학2    진로활동");
			System.out.println("심화국어       영독작         체육         영독작           공학일반");
			System.out.println("공학일반       심화국어      교육학       심화국어        통합수학2");
			System.out.println("미술            영독작         창체          자율             통합수학1");
			System.out.println("통합수학1  생명과학2   창체          논리학          생명과학2");
			System.out.println("교육학         통합수학2  생명과학2  통합수학2   한국사");
		}
		
		// 학식 자료입력
		String[][] lunches = {
				{"없음","없음","없음","없음","없음"},
				{"없음","없음","없음","없음","없음"},
				{"없음","없음","없음","없음","없음"},
				{"현미밥","된장국","로제치즈옹볶이","밤송송함박","달고나우유마카롱"},
				{"백미밥","미역국","안동찜닭","바나나칩고구마맛탕","노랑잡채만두+비빔야채"},
				{"백미밥","참치김치찌개","더블치즈돈까스","투움바파스타","레몬스틱젤리"},
				{"잡곡밥","모듬어묵국","연두부+양념장","고추장돼지두루치기","블랙타이거새우치즈구이"},
				{"통밀밥","냉이단배추쑥국","불마요들기름막국수","부들어묵볶음","크리스피돈육강정"},
				{"없음","없음","없음","없음","없음"},
				{"없음","없음","없음","없음","없음"},
				{"백미밥","쇠고기콩나물국","크림떡볶이","알감자버터구이","순살고등어구이"},
				{"발아현미밥","부대찌개","쫄면야채무침","두부달걀구이","미니돈까스"},
				{"혼합잡곡밥","들깨시락국","곤약메추리알조림","불막창닭어깨살볶음","수제피쉬까스+알새우칩"},
				{"백미밥","김치어묵국","우엉잡채","파일애플주스","함박스테이크"},
				{"현미밥","돼지고기순두부찌개","알리오올리오파스타","숯불치마호크","겨울초겉절이"},
				{"없음","없음","없음","없음","없음"},
				{"없음","없음","없음","없음","없음"},
				{"흑미밥","등뼈감자탕","마파두부","훈제족살냉채무침","토마토꿀절임"},
				{"보리밥","들깨근대된장국","자두주스","동파육+청경채","사과꽃맛살샐러드"},
				{"혼합잡곡밥","새알만두국","치즈연어까스+타르타르소스","닭다리살양념바베큐","브로콜리-들나물"},
				{"돼지국밥소면","일식계란찜","부추겉절이","참치김치전","오렌지"},
				{"현미밥","두부달걀국","분모자닭갈비","청양풍볶음우동","아이스슈"},
				{"없음","없음","없음","없음","없음"},
				{"없음","없음","없음","없음","없음"},
				{"혼합잡곡밥","돼지목살고추장찌개","두반장감자조림","수제치킨까스+치폴레소스","키위드레싱"},
				{"흑미밥","모듬어묵국","도토리묵채소무침","오리대패불고기","팔도그롤+케찹"},
				{"숯불치밥","황태무국","국물떡볶이","당면튀김만두","딸바라떼"},
				{"카레라이스","우엉유자청강정","달래오이생채","갈비맛치킨스테이크","석류주스"},
				{"귀리밥","동인동갈비찜","토마토겉절이","고구마크로켓+케찹","요구르트"},
				{"없음","없음","없음","없음","없음"},
				{"없음","없음","없음","없음","없음"}
		};
		String[][] dinners = {
				{"없음","없음","없음","없음","없음"},
				{"없음","없음","없음","없음","없음"},
				{"없음","없음","없음","없음","없음"},
				{"쇠고기야채죽","TX치킨버거","벌집감자튀김","치즈시즈닝","델몬트망고주스"},
				{"백미밥","사골조랭이떡국","옥수수콘샐러드","김치메밀전병","허니순살치킨"},
				{"오므라이스","맑은콩나물국","푸실리샐러드","맨츠카츠+소스","죠리퐁라떼"},
				{"백미밥","해물순두부찌개","마라닭갈비","오지치즈후라이","허쉬초콜릿칩쿠키"},
				{"참치마요오니기리","육천물쫄면","갈비만두","새우튀김","골드키위주스"},
				{"없음","없음","없음","없음","없음"},
				{"없음","없음","없음","없음","없음"},
				{"스팸햄김치볶음밥","우동","치킨텐더+머스타드소스","롱트위스트파이","요거타임사과"},
				{"보리밥","옥수수콘치즈바베큐치킨","수제고구마튀김","망고주스","팽이버섯된장국"},
				{"백미밥","감자옹심이국","꼬치없는소떡소떡","갈비후라이드","누네띠네카라멜크림치즈"},
				{"김밥볶음밥","가쓰오장국","청년다방떡볶이","타코야키","깔라만시레몬에이드"},
				{"마제덮밥","왕만두국","회오리감자","포도주스","없음"},
				{"없음","없음","없음","없음","없음"},
				{"없음","없음","없음","없음","없음"},
				{"추억의도시락","건새우맑은무국","수제망고라씨","핫도그","없음"},
				{"후리카케밥","잔치국수","옥수수콘샐러드","하프롱닭구이","자두나무"},
				{"치킨마요덮밥","김치콩나물국","참나물유자청무침","갈비+떡꼬치구이","샤인머스켓주스"},
				{"땡초고기주먹밥","마라탕","딤섬부추장펀","꿔바로우","스위티자몽주스"},
				{"토마토스파게티","베이컨감자스프","콘소메이징치킨+감자튀김","델몬트주스","그린샐러드"},
				{"없음","없음","없음","없음","없음"},
				{"없음","없음","없음","없음","없음"},
				{"새우달걀볶음밥+자장소스","해물짬뽕국","열대과일샐러드","망고드레싱","맛동산탕수육"},
				{"참치생야채비빔밥","콩가루숭늉","마카로니샐러드","불고기퀘사디아","초코첵스+우유"},
				{"후리카케밥","냉메밀국수","허니생크림카스테라","요거트생과일샐러드","지파이+시즈닝"},
				{"없음","없음","없음","없음","없음"},
				{"참치마요밥버거","탄탄면","닭꼬치데리야끼구이","파인애플주스","없음"},
				{"없음","없음","없음","없음","없음"},
				{"없음","없음","없음","없음","없음"}
		};
		
		// 날짜 가져오기
		Calendar c = Calendar.getInstance();		// 추상클래스 Calendar의 하위클래스에서 인스턴스를 가져옴 -> 객체 생성 가능
		int day = c.get(Calendar.DAY_OF_MONTH);		// get() 메소드를 통해 정보를 얻으며, Calendar 클래스 내부에 상수를 이용한다.
		
		// 그 날짜의 중식 출력
		System.out.println();
		System.out.println("🍚 중식 🍚");
		for (int i = 0; i < lunches[0].length; i += 1) {
			System.out.println("● " + lunches[day-1][i]);
		}
		
		// 그 날짜의 석식 출력
		System.out.println();
		System.out.println("🍚 석식 🍚");
		for (int i = 0; i < dinners[0].length; i += 1) {
			System.out.println("● " + dinners[day-1][i]);
		}
	}
}
